import { Options } from 'highcharts';

export const statusChartOptions: Options = {
  chart :{
    inverted: true,
    height: '100%',
  },
  // การให้ เครดิต
  credits:{
    enabled : false
  },
  title: {
      text: 'Thailand'
  },
  
  xAxis: {
      visible: false ,
  },
  yAxis: {
      visible: false,
  }, 
  // กำหนดสีของ box ตามสถานะ
  colorAxis: {
    accessibility:{
      enabled : true,
      description : 'status service'
    },
    dataClasses: [
      {
        from :1,
        to: 1,
        color: '#94d82d',
        name: 'Connected',
      },{
        from: 2,
        to: 2,
        color: '#e03131',
        name: 'Disconnect'
      },{
        from: 3,
        to: 3,
        color: '#ced4da',
        name: 'No service'
    }]
  },
  // กำหนดการแสดงผลคำอธิบายของสี
  legend: {
    padding: 0,
    enabled: true,
    layout: 'vertical',  // เขียนเป็นแนวตั้ง
    align: 'right',
    y: -20,
    x: -20
  },
  // แสดงข้อมูลเมื่อชี้เมาท์
  tooltip: {
      enabled : true, // การสั่งเปิด/ปิด การใช้งาน tooltip default = true
      headerFormat: 'Hello<br>', // กำหนดแสดงข้อมูล T = ปิด, F = เปิด
      pointFormat: 'จังหวัด {point.name}', // แสดงข้อมูล
      animation: true, // ความพริ้วของ poiter default = true
      borderRadius: 20, //ความมนของขอบ
      padding : 10, // ขนาดความกลว้างของกล่อง
      shadow: true, // เงา
      distance : 10,
      

    
  },
  // เป็นการเขียนชื่อลงจุด
  plotOptions: {
    tilemap: {
      dataLabels: {
        enabled: true,
        format: '{point.key}',
        color: '#333333', 
        style:{
          fontSize: '9',
          fontWeight :'20',
          textOutline :'true'
        }                
      }, 
      borderColor: 'none', // สีขอบโหนด        
    },
  },

  // ชุดของข้อมูลบน chart
  series: [{
      type : 'tilemap',    
      keys : ['key','name','x','y','value'],
      data :[
          ['MSN', 'แม่ฮ่องสอน', 0, 0, 1],
          ['CMI', 'เชียงใหม่', 0, 1, 1],
          ['CRI', 'เชียงราย', 0, 2, 1],
          ['PRE', 'แพร่', 0, 3, 1],
          ['LPN', 'ลำพูน', 1, 0, 1],
          ['LPG', 'ลำปาง', 1, 1, 1],
          ['PYO', 'พะเยา', 1, 2, 1],
          ['UTT', 'อุตรดิตถ์', 1, 3, 2],
          ['NAN', 'น่าน', 1, 4, 1],
          ['STI', 'สุโขทัย', 2, 1, 1],
          ['KPT', 'กำแพงเพชร', 2, 2, 1],
          ['PCT', 'พิจิตร', 2, 3, 1],
          ['UTI', 'อุทัยธานี', 3, 1, 1],
          ['NSN', 'นครสวรรค์', 3, 2, 2],
          ['PLK', 'พิษณุโลก', 3, 3, 1],
          ['PNB', 'เพชรบูรณ์', 3, 4, 1],
          ['CNT', 'ชัยนาท', 4, 1, 1],
          ['LRI', 'ลพบุรี', 4, 2, 1],
          ['SBR', 'สิงห์บุรี', 4, 3, 1],
          ['SPB', 'สุพรรณบุรี', 5, 2, 1],
          ['ATG', 'อ่างทอง', 5, 3, 1],
          ['NPT', 'นครปฐม', 6, 1, 2],
          ['NBI', 'นนทบุรี', 6, 2, 1],
          ['BKK', 'กรุงเทพมหานคร', 6, 3, 1],
          ['AYA', 'พระนครศรีอยุธยา', 6, 4, 1],
          ['PBI', 'เพชรบุรี', 6, 5, 1],
          ['SRI', 'สระบุรี', 6, 6, 1],
          ['NYK', 'นครนายก', 6, 7, 1],
          ['SKN', 'สมุทรสาคร', 7, 3, 1],
          ['SKM', 'สมุทรสงคราม', 7, 4, 1],
          ['SPK', 'สมุทรปราการ', 7, 5, 1],
          ['TAK', 'ตาก', 2, 0, 1],
          ['TAK', 'ตาก', 2, 0, 1],
          ['KRI', 'กาญจนบุรี', 5, 1, 1],
          ['RBR', 'ราชบุรี', 7, 2, 1],
          ['PBI', 'เพชรบุรี', 8, 2, 1],
          ['PKN', 'ประจวบคีรีขันธ์', 9, 2, 1],
          ['UDN', 'อุดรธานี', 2, 6, 1],
          ['NKI', 'หนองคาย', 2, 7, 2],
          ['BKN', 'บึงกาฬ', 2, 8, 1],
          ['LEI', 'เลย', 3, 5, 1],
          ['NBP', 'หนองบัวลำภู', 3, 6, 1],
          ['KKN', 'ขอนแก่น', 3, 7, 1],
          ['SNK', 'สกลนคร', 3, 8, 1],
          ['NPM', 'นครพนม', 3, 9, 1],
          ['CPM', 'ชัยภูมิ', 4, 4, 1],
          ['MKM', 'มหาสารคาม', 4, 5, 1],
          ['RET', 'ร้อยเอ็ด', 4, 6, 1],
          ['KSN', 'กาฬสินธู์', 4, 7, 1],
          ['MDH', 'มุกดาหาร', 4, 8, 1],
          ['ACR', 'อำนาจเจริญ', 4, 9, 3],
          ['NMA', 'นครราชสีมา', 5, 4, 1],
          ['BRM', 'บุรีรัมย์', 5, 5, 1],
          ['SRN', 'สุรินทร์', 5, 6, 1],
          ['SSK', 'ศรีสะเกษ', 5, 7, 1],
          ['YST', 'ยโสธร', 5, 8, 1],
          ['UBN', 'อุบลราชธานี', 5, 9, 1],
          ['PRI', 'ปราจีนบุรี', 6, 8, 1],
          ['SKW', 'สระแก้ว', 6, 9, 1],
          ['CCO', 'ฉะเชิงเทรา', 7, 6, 1],
          ['CBI', 'ชลบุรี', 8, 4, 3],
          ['RYG', 'ระยอง', 8, 5, 1],
          ['CTI', 'จันทบุรี', 8, 6, 1],
          ['TRT', 'ตราด', 9, 7, 1],
          ['RNG', 'ระนอง', 10, 1, 1],
          ['CPN', 'ชุมพร', 10, 2, 1],
          ['PNA', 'พังงา', 11, 1, 1],
          ['SNI', 'สุราษฎร์ธานี', 11, 2, 1],
          ['PKT', 'ภูเก็ต', 12, -0.4, 1],
          ['KBI', 'กระบี่', 12, 1, 1],
          ['NST', 'นครศรีธรรมราช', 12, 2, 1],
          ['TRG', 'ตรัง', 13, 2, 1],
          ['PLG', 'พัทลุง', 13, 3, 1],
          ['STN', 'สตูล', 14, 1, 1],
          ['SKA', 'สงขลา', 14, 2, 3],
          ['PTN', 'ปัตตานี', 14, 3, 1],
          ['YLA', 'ยะลา', 15, 3, 2],
          ['NWT', 'นราธิวาส', 15, 4, 1],          
      ]
  }]
  
};